/* RuleEditorController */
"%@ (Disabled: %@)" = "%1$@ (ఆపివేయబడింది: %2$@)";

/* SettingsViewController */
"About" = "గురించి";

/* BookmarkViewController */
"Add Bookmark" = "బుక్మార్క్ జోడించు";

/* RuleEditorController */
"All rules" = "అన్ని నియమాలు";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "3 వ పార్టీ కీబోర్డులను అనుమతించండి";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "శాశ్వతంగా కుకీలు మరియు స్థానిక నిల్వ డేటాబేస్లను నిల్వ చేయడానికి హోస్ట్లను అనుమతించండి";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "HTTPS కాని హోస్ట్ల నుండి పేజీ వనరులను HTTPS హోస్ట్లను అనుమతించు (RSS రీడర్లు మరియు ఇతర అగ్రిగేటర్లకు ఉపయోగకరం)";

/* SecurityViewController */
"Allow Persistent Cookies" = "నిరంతర కుకీలను అనుమతించు";

/* Tab+UIWebViewDelegate */
"Allow this page to close its tab?" = "ఈ పేజీ దాని టాబ్ని మూసివేయడానికి  అనుమతించాలా?";

/* Tab+Gestures */
"An error occurred downloading image %@" = "%@ చిత్రాన్ని డౌన్లోడ్ చేస్తున్నప్పుడు లోపం సంభవించింది";

/* AppDelegate */
"Authentication Required" = "ప్రామాణీకరణ అవసరం";

/* URLBlockerRuleController */
"Blocked 3rd-Party Hosts" = "బ్లాక్ చేసిన 3-పార్టీ హోస్ట్లు";

/* BookmarksViewController */
"Bookmarks" = "బుక్ మార్క్స్";

/* CircuSitsViewController */
"Bridge Configuration" = "బ్రిడ్జ్ ఆకృతీకరణ";

/* DonationViewController */
"Cancel" = "రద్దు";

/* SettingsViewController */
"Changing this option requires restarting the app." = "ఈ ఎంపికను మార్చడం అనువర్తనాన్ని పునఃప్రారంభించడానికి అవసరం";

/* AppDelegate */
"Close Tab" = "మూసెయ్";

/* Tab+UIWebViewDelegate */
"Confirm" = "నిర్ధారించండి";

/* SecurityViewController */
"Content Policy" = "కంటెంట్ విధానం";

/* SettingsViewController, Storage1ViewController, Storage2ViewController */
"Cookies and Local Storage" = "కుకీలు మరియు స్థానిక నిల్వ";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "ఈ అనేక నిమిషాలు ప్రాప్యత చేయబడని తర్వాత తెరిచిన ట్యాబ్ల నుండి కుక్కీలు మరియు స్థానిక నిల్వ డేటా హోస్ట్ కాని అనుమతి హోస్ట్ల నుండి కూడా క్లియర్ చేయబడతాయి";

/* Tab+Gestures */
"Copy URL" = "URL ను కాపీ చేయండి";

/* AppDelegate */
"Create New Tab" = "క్రొత్త టాబ్ సృష్టించండి";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "అనుకూల వినియోగదారు ఏజెంట్ స్ట్రింగ్ లేదా డిఫాల్ట్ ఉపయోగించడానికి ఖాళీ";

/* HostSettings */
"Default Settings" = "డిఫాల్ట్ సెట్టింగులు";

/* RuleEditorController */
"Disable" = "డిసేబుల్";

/* RuleEditorController */
"Disabled: %@" = "నిలిపివేయబడింది: %@";

/* BrowsingViewController */
"Done" = "పూర్తి";

/* BookmarkViewController */
"Edit Bookmark" = "బుక్మార్క్ను సవరించండి";

/* RuleEditorController */
"Enable" = "ప్రారంభించు";

/* Tab+Gestures, Tab+UIWebViewDelegate */
"Error" = "లోపం";

/* AppDelegate */
"Focus URL Field" = "URL ఫీల్డ్ ఫోకస్ చేయండి";

/* AppDelegate */
"Go Back" = "వెనక్కి వెళ్ళు";

/* AppDelegate */
"Go Forward" = "ముందుకు వెళ్ళు";

/* SettingsViewController */
"HTTPS Everywhere" = "అన్నిచోట్లా HTTPS";

/* HTTPSEverywhereRuleController */
"HTTPS Everywhere Rules" = "HTTPS ప్రతిచోటా నియమాలు";

/* AppDelegate */
"Log In" = "లాగ్ ఇన్";

/* SettingsViewController */
"Miscellaneous" = "ఇతరాలు";

/* SecurityViewController */
"No XHR/WebSocket/Video connections" = " XHR / WebSocket / వీడియో కనెక్షన్లు కాదు";

/* JAHPAuthenticatingHTTPProtocol, Tab+Gestures, Tab+UIWebViewDelegate, DonationViewController */
"OK" = "అలాగే";

/* Tab+Gestures */
"Open" = "ఓపెన్";

/* SecurityViewController */
"Open (normal browsing mode)" = "తెరువు (సాధారణ బ్రౌజింగ్ మోడ్)";

/* Tab+Gestures */
"Open in a New Tab" = "క్రొత్త ట్యాబ్లో తెరవండి";

/* Tab+Gestures */
"Open in Safari" = "Safari లో తెరవండి";

/* SecurityViewController */
"Other" = "ఇతర";

/* AppDelegate */
"Password" = "పాస్వర్డ్";

/* SecurityViewController */
"Privacy" = "గోప్యతా";

/* Tab */
"Pull to Refresh Page" = "పేజీని రిఫ్రెష్ చేయడానికి పుల్ చేయండి";
/* SettingsViewController */
"Rate on App Store" = "యాప్ స్టోర్ లో రేట్ చేయండి";

/* SettingsViewController */
"Report a Bug" = "ఒక బగ్ రిపోర్ట్ చెయ్యండి";

/* SecurityViewController */
"Restrictions on resources loaded from web pages." = "వెబ్ పేజీల నుండి లోడ్ చేయబడిన వనరులపై పరిమితులు";

/* RuleEditorController */
"Rules in use on current page" = "ప్రస్తుత పేజీలో ఉపయోగంలో ఉన్న నియమాలు";

/* Tab+Gestures */
"Save Image" = "చిత్రాన్ని సేవ్ చేయండి";

/* SettingsViewController */
"Search Engine" = "శోధన యంత్రము";

/* SettingsViewController */
"Send Do-Not-Track Header" = "డో-నాట్-ట్రాక్ శీర్షికను పంపండి";

/* SettingsViewController */
"Settings" = "సెట్టింగులు";

/* AppDelegate */
"Show Bookmarks" = "బుక్మార్క్లను చూపు";

/* SecurityViewController */
"Strict (no JavaScript, video, etc.)" = "ఖచ్చితమైనది (జావాస్క్రిప్ట్, వీడియో, మొదలైనవి లేదు)";

/* SettingsViewController */
"Support" = "మద్దతు";

/* AppDelegate */
"Switch to Tab %d" = "టాబ్కు మారండి %d";

/* SettingsViewController */
"TLS Version" = "TLS సంస్కరణ";

/* AddSiteViewController */
"URL" = "URL";

/* SettingsViewController */
"URL Blocker" = "URL బ్లాకర్";

/* SecurityViewController */
"User Agent" = "యూజర్ ఏజెంట్";

/* RuleEditorController */
"User disabled" = "వినియోగదారు నిలిపివేయబడింది";

/* SettingsViewController */
"Version %@" = "Version %@";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* DonationViewController */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
